<a href="https://colab.research.google.com/github/Beatriz-Yun/CatchingDudeoji/blob/main/ch08/8.3%20%EC%9E%AC%ED%98%95%EC%84%B1%EA%B3%BC%20%ED%94%BC%EB%B2%97.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 8ì¥. ë°ì´í„° ì¤€ë¹„í•˜ê¸°

## 8.3ì ˆ ì¬í˜•ì„±ê³¼ í”¼ë²— (Reshaping and Pivot)
(334-344ìª½)

**í‘œ í˜•ì‹ì˜ ë°ì´í„°ë¥¼ ì¬ë°°ì¹˜**í•˜ëŠ” ê¸°ë³¸ì ì¸ ì—°ì‚°ì„ **'ì¬í˜•ì„±' ë˜ëŠ” 'í”¼ë²—' ì—°ì‚°**ì´ë¼ê³  í•œë‹¤.

## 8.3.1 ê³„ì¸µì  ìƒ‰ì¸ìœ¼ë¡œ ì¬í˜•ì„±í•˜ê¸° (Reshaping with Hierarchical Indexing)

ê³„ì¸µì  ìƒ‰ì¸ì€ DataFrameì˜ ë°ì´í„°ë¥¼ ì¬ë°°ì¹˜í•˜ëŠ” 2ê°€ì§€ ë°©ì‹ì„ ì œê³µí•œë‹¤.
- **stack**: ë°ì´í„°ì˜ ì¹¼ëŸ¼ì„ ë¡œìš°ë¡œ pivot(íšŒì „)ì‹œí‚¨ë‹¤.
- **unstack**: ë°ì´í„°ì˜ ë¡œìš°ë¥¼ ì¹¼ëŸ¼ìœ¼ë¡œ pivot(íšŒì „)ì‹œí‚¨ë‹¤.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),         # ì¸ë±ìŠ¤ëª…
                    columns=pd.Index(['one', 'two', 'three'], name='number'))   # ì¹¼ëŸ¼ëª…
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

**stackë©”ì„œë“œ**: ì¹¼ëŸ¼ì´ ë¡œìš°ë¡œ pivotëœë‹¤. Seriesê°ì²´ë¥¼ ë°˜í™˜í•¨.
- one, two, threeê°€ 'state'ì˜ í•˜ìœ„ ìˆ˜ì¤€ ë¡œìš°ë¡œ ë“¤ì–´ê°„ë‹¤.

[ê³µì‹ë¬¸ì„œ) pandas.DataFrame.stack](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.stack.html)

In [ ]:
result = data.stack()
result    # Series ê°ì²´

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

**unstackë©”ì„œë“œ**: ë¡œìš°ê°€ ì¹¼ëŸ¼ìœ¼ë¡œ pivotëœë‹¤. ê³„ì¸µì  ìƒ‰ì¸ì„ ê°€ì§„ Seriesë¡œë¶€í„° DataFrameì„ ì–»ì„ ìˆ˜ ìˆë‹¤.


[ê³µì‹ë¬¸ì„œ) pandas.DataFrame.unstack](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.unstack.html)

In [ ]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#### stackê³¼ unstackë©”ì„œë“œì˜ **ë§¤ê°œë³€ìˆ˜ level**ì€ ì–´ë–¤ ê±¸ ë¨¼ì € ë„ì§‘ì–´ë‚´ëŠ”ì§€ ì§€ì •í•˜ëŠ” ì¸ìì´ë‹¤.
- levelì˜ defaultê°’ì€ -1ë¡œ, ê¸°ë³¸ì ìœ¼ë¡œ **ê°€ì¥ ì•ˆìª½ì— ìˆëŠ” levelë¶€í„°** ë„ì§‘ì–´ë‚¸ë‹¤. (ìœ„ì˜ ê²½ìš°ì—ì„œ ê°€ì¥ ì•ˆìª½ì— ìˆëŠ” levelì€ 'number'ì´ë‹¤.)
- **level ìˆ«ìë‚˜ ì´ë¦„**ì„ ì „ë‹¬í•˜ì—¬ ë„ì§‘ì–´ë‚´ëŠ” ë‹¨ê³„ë¥¼ ì§€ì •í•  ìˆ˜ ìˆë‹¤.

In [ ]:
result.unstack(0)    # levelì´ 0ì¸ ì¸ë±ìŠ¤ëŠ” ìƒìœ„ê³„ì¸µìƒ‰ì¸ 'state'ì´ë‹¤.

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [ ]:
result.unstack('state')    # ë¨¼ì € ë„ì§‘ì–´ë‚¼ level ì´ë¦„ì„ ì „ë‹¬í•˜ì˜€ë‹¤.

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

#### í•´ë‹¹ levelì— ìˆëŠ” ëª¨ë“  ê°’ì´ í•˜ìœ„ ê·¸ë£¹ì— ì†í•˜ì§€ ì•Šì„ ê²½ìš°, unstackì„ í•˜ê²Œ ë˜ë©´ ëˆ„ë½ëœ ë°ì´í„°ê°€ ìƒê¸¸ ìˆ˜ ìˆë‹¤.
- 'one'ì˜ í•˜ìœ„ê·¸ë£¹ì€ ['a', 'b', **'c', 'd'**]
- 'two'ì˜ í•˜ìœ„ê·¸ë£¹ì€ [**'c', 'd'**, 'e']

<br>

'one'ê³¼ 'two'ì˜ levelì— ìˆëŠ” ëª¨ë“  ê°’ì´ í•˜ìœ„ ê·¸ë£¹ì— ì†í•˜ì§€ ì•ŠëŠ”ë‹¤!!<br>
ğŸ‘‰ unstackì„ í•˜ê²Œ ë˜ë©´ 'a', 'b', 'c'ì— ëˆ„ë½ëœ ë°ì´í„°ê°€ ìƒê¸´ë‹¤.

In [ ]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
data2 = pd.concat([s1, s2], keys=['one', 'two'])    # Seriesê°ì²´ì¸ s1ì€ 'one'ì¸ë±ìŠ¤ì—, s2ëŠ” 'two'ì¸ë±ìŠ¤ì— ì†í•˜ê²Œ ëœë‹¤. (ê³„ì¸µì  ìƒ‰ì¸)

data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [ ]:
data2.unstack()    # ì•ˆìª½ level ë¨¼ì € ë„ì§‘ì–´ ëƒ„.

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

stack ë©”ì„œë“œëŠ” ëˆ„ë½ëœ ë°ì´í„°ë¥¼ ìë™ìœ¼ë¡œ ê±¸ëŸ¬ë‚´ê¸° ë•Œë¬¸ì— **ì—°ì‚°ì„ ì‰½ê²Œ ì›ìƒ ë³µêµ¬**í•  ìˆ˜ ìˆë‹¤.

In [ ]:
data2.unstack().stack()    # NaNì´ ìë™ìœ¼ë¡œ ì œê±°ëœë‹¤.

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [ ]:
data2.unstack().stack(dropna=False)    # dropna ë§¤ê°œë³€ìˆ˜ë¡œ NaNì„ ê·¸ëŒ€ë¡œ ë‚¨ê¸¸ ìˆ˜ ìˆë‹¤.

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

DataFrameì„ unstackí•  ë•Œ unstack levelì€ ê²°ê³¼ì—ì„œ ê°€ì¥ ë‚®ì€ ë‹¨ê³„ê°€ ëœë‹¤.(?)

In [ ]:
df = pd.DataFrame({'left': result, 'right': result + 5},
                  columns=pd.Index(['left', 'right'], name='side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [ ]:
df.unstack('state')    # 'state'ë¥¼ ì¹¼ëŸ¼ìœ¼ë¡œ ë„ì§‘ì–´ëƒ„.
                       # 'side'ë³´ë‹¤ ë°‘ì— ìˆê²Œ ëœë‹¤. 'state'ëŠ” 'side'ì˜ í•˜ìœ„ ìˆ˜ì¤€ ìƒ‰ì¸.

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

stackì„ í˜¸ì¶œí•  ë•Œ ìŒ“ì„ ì¶•ì˜ ì´ë¦„ì„ ì§€ì •í•  ìˆ˜ ìˆë‹¤.

In [ ]:
df.unstack('state').stack('side')    # ìœ„ì˜ unstackê²°ê³¼ë¥¼ 'side'ë¡œ ë‹¤ì‹œ stack

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

## 8.3.2 ê¸´ í˜•ì‹ì—ì„œ ë„“ì€ í˜•ì‹ìœ¼ë¡œ í”¼ë²—í•˜ê¸° (Pivoting â€œLongâ€ to â€œWideâ€ Format)

In [ ]:
data = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/macrodata.csv')
data.head()

     year  quarter   realgdp  realcons  ...  unemp      pop  infl  realint
0  1959.0      1.0  2710.349    1707.4  ...    5.8  177.146  0.00     0.00
1  1959.0      2.0  2778.801    1733.7  ...    5.1  177.830  2.34     0.74
2  1959.0      3.0  2775.488    1751.8  ...    5.3  178.657  2.74     1.09
3  1959.0      4.0  2785.204    1753.7  ...    5.6  179.386  0.27     4.06
4  1960.0      1.0  2847.699    1770.5  ...    5.2  180.007  2.31     1.19

[5 rows x 14 columns]

In [ ]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter, name='date')    # ì‹œê°„ê°„ê²©ì„ ë‚˜íƒ€ë‚´ëŠ” ìë£Œí˜•. ì—°ë„ì™€ ë¶„ê¸° ì¹¼ëŸ¼ì„ í•©ì¹œë‹¤.
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

data = data.reindex(columns=columns)
data.index = periods.to_timestamp('D', 'end')

ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [ ]:
periods    # 11ì¥ ì°¸ê³  - pd.PeriodIndex

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

ldataëŠ” **ê¸´ í˜•ì‹ì˜ ë°ì´í„°**ì´ë‹¤.
- ì—¬ëŸ¬ ì‹œê³„ì—´ì´ë‚˜ ë‘˜ ì´ìƒì˜ í‚¤('date'ì™€ 'item)ë¥¼ ê°€ì§€ê³  ìˆëŠ” ê´€ì¸¡ ë°ì´í„°ì—ì„œ ì‚¬ìš©í•œë‹¤.
- ê° í–‰ì€ 'ë‹¨ì¼ ê´€ì¸¡ì¹˜'ë¥¼ ë‚˜íƒ€ë‚¸ë‹¤.


ê´€ê³„í˜• ë°ì´í„°ë² ì´ìŠ¤ ê´€ì ì—ì„œ ë³´ë©´, í…Œì´ë¸”ì— ë°ì´í„°ê°€ ì¶”ê°€ë˜ê±°ë‚˜ ì‚­ì œë  ë•Œ **'date'ì™€ 'item'ì€ ê¸°ë³¸í‚¤(primary key)**ê°€ ëœë‹¤.<br>

<br>

ê¸´ í˜•ì‹ì˜ ë°ì´í„°ë¡œëŠ” ì‘ì—…ì´ ìš©ì´í•˜ì§€ ì•Šì„ ìˆ˜ ìˆì–´ì„œ<br>
í•˜ë‚˜ì˜ DataFrameì— 'date'ì¹¼ëŸ¼ì˜ ì‹œê°„ê°’ìœ¼ë¡œ ìƒ‰ì¸ëœ ê°œë³„ itemì„ ì¹¼ëŸ¼ìœ¼ë¡œ í¬í•¨ì‹œí‚¤ê³  ì‹¶ì–´ì§ˆ ê²ƒì´ë‹¤.<br>
ğŸ‘‰ ì´ëŸ° ë³€í˜•ì„ ì§€ì›í•˜ëŠ” ê²ƒì´ ë°”ë¡œ **DataFrameì˜ pivotë©”ì„œë“œ**ì´ë‹¤.

In [ ]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

pivotë©”ì„œë“œì˜ ì²˜ìŒ ë‘ ì¸ìëŠ” **ë¡œìš°ì™€ ì¹¼ëŸ¼ ì¸ë±ìŠ¤ë¡œ ì‚¬ìš©ë  ì¹¼ëŸ¼ëª…**ì´ë‹¤.
- ë¡œìš° ì¸ë±ìŠ¤ë¡œ ì‚¬ìš©: 'date', ì¹¼ëŸ¼ ì¸ë±ìŠ¤ë¡œ ì‚¬ìš©: 'item'

ë§ˆì§€ë§‰ ë‘ ì¸ìëŠ” **DataFrameì— ì±„ì›Œ ë„£ì„ ê°’ì„ ë‹´ê³  ìˆëŠ” ì¹¼ëŸ¼**ì´ë‹¤.
- 'value'

In [ ]:
pivoted = ldata.pivot('date', 'item', 'value')    # infl, realgdp, unempëŠ” 'item'ì˜ ê°’ì´ë‹¤.
pivoted

item                           infl    realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00   2710.349    5.8
1959-06-30 23:59:59.999999999  2.34   2778.801    5.1
1959-09-30 23:59:59.999999999  2.74   2775.488    5.3
1959-12-31 23:59:59.999999999  0.27   2785.204    5.6
1960-03-31 23:59:59.999999999  2.31   2847.699    5.2
...                             ...        ...    ...
2008-09-30 23:59:59.999999999 -3.16  13324.600    6.0
2008-12-31 23:59:59.999999999 -8.79  13141.920    6.9
2009-03-31 23:59:59.999999999  0.94  12925.410    8.1
2009-06-30 23:59:59.999999999  3.37  12901.504    9.2
2009-09-30 23:59:59.999999999  3.56  12990.341    9.6

[203 rows x 3 columns]

#### í•œ ë²ˆì— 2ê°œì˜ ì¹¼ëŸ¼ì„ ë™ì‹œì— ë³€í˜•í•  ìˆ˜ ìˆë‹¤.

In [ ]:
ldata['value2'] = np.random.randn(len(ldata))   # 'value2'ì¹¼ëŸ¼ ìƒì„±
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.247819
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.225046
2 1959-03-31 23:59:59.999999999    unemp     5.800  0.033125
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -1.755287
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.989052
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.518612
6 1959-09-30 23:59:59.999999999  realgdp  2775.488  0.154187
7 1959-09-30 23:59:59.999999999     infl     2.740  0.830718
8 1959-09-30 23:59:59.999999999    unemp     5.300 -1.566133
9 1959-12-31 23:59:59.999999999  realgdp  2785.204 -0.132290

ë§ˆì§€ë§‰ ì¸ìë¥¼ ìƒëµí•´ì„œ ê³„ì¸µì  ì¹¼ëŸ¼ì„ ê°€ì§€ëŠ” DataFrameì„ ì–»ì„ ìˆ˜ ìˆë‹¤.

In [ ]:
pivoted = ldata.pivot('date', 'item')
pivoted[:5]

                              value            ...    value2
item                           infl   realgdp  ...   realgdp     unemp
date                                           ...
1959-03-31 23:59:59.999999999  0.00  2710.349  ...  0.247819  0.033125
1959-06-30 23:59:59.999999999  2.34  2778.801  ... -1.755287  0.518612
1959-09-30 23:59:59.999999999  2.74  2775.488  ...  0.154187 -1.566133
1959-12-31 23:59:59.999999999  0.27  2785.204  ... -0.132290  0.482726
1960-03-31 23:59:59.999999999  2.31  2847.699  ...  0.203997  0.854384

[5 rows x 6 columns]

ê° í”¼ë´‡í…Œì´ë¸”ì„ ìœ„ì˜ ê³„ì¸µì  ì¹¼ëŸ¼ì„ ê°€ì§€ëŠ” DataFrameì„ ì¸ë±ì‹±í•˜ì—¬ ì–»ì„ ìˆ˜ ìˆë‹¤.

In [ ]:
pivoted['value'][:5]

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

#### pivotì€ ë‹¨ì§€ **set_indexë¥¼ ì‚¬ìš©í•´ì„œ ê³„ì¸µì  ìƒ‰ì¸ì„ ë§Œë“¤ê³ , unstackë©”ì„œë“œë¥¼ ì‚¬ìš©í•´ì„œ í˜•íƒœë¥¼ ë³€ê²½**í•˜ëŠ” ë‹¨ì¶•í‚¤ ê°™ì€ ë©”ì„œë“œì´ë‹¤.

In [ ]:
ldata.set_index(['date', 'item'])

                                           value    value2
date                          item
1959-03-31 23:59:59.999999999 realgdp   2710.349  0.247819
                              infl         0.000 -0.225046
                              unemp        5.800  0.033125
1959-06-30 23:59:59.999999999 realgdp   2778.801 -1.755287
                              infl         2.340 -0.989052
...                                          ...       ...
2009-06-30 23:59:59.999999999 infl         3.370 -1.856087
                              unemp        9.200  1.241295
2009-09-30 23:59:59.999999999 realgdp  12990.341  0.605301
                              infl         3.560  0.129146
                              unemp        9.600  0.727602

[609 rows x 2 columns]

ê³„ì¸µì  ì¹¼ëŸ¼ì„ ê°€ì§€ëŠ” DataFrameì´ ë§Œë“¤ì–´ì§„ë‹¤.

In [ ]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')    # set_indexì™€ unstackì„ ìˆœì°¨ì ìœ¼ë¡œ ì ìš©í•œ ê²°ê³¼ì™€ pivotì˜ ê²°ê³¼ëŠ” ê°™ë‹¤.
unstacked[:7]

                              value            ...    value2
item                           infl   realgdp  ...   realgdp     unemp
date                                           ...
1959-03-31 23:59:59.999999999  0.00  2710.349  ...  0.247819  0.033125
1959-06-30 23:59:59.999999999  2.34  2778.801  ... -1.755287  0.518612
1959-09-30 23:59:59.999999999  2.74  2775.488  ...  0.154187 -1.566133
1959-12-31 23:59:59.999999999  0.27  2785.204  ... -0.132290  0.482726
1960-03-31 23:59:59.999999999  2.31  2847.699  ...  0.203997  0.854384
1960-06-30 23:59:59.999999999  0.14  2834.390  ... -0.518109  1.004842
1960-09-30 23:59:59.999999999  2.70  2839.022  ... -0.644334 -1.786207

[7 rows x 6 columns]

## 8.3.3 ë„“ì€ í˜•ì‹ì—ì„œ ê¸´ í˜•ì‹ìœ¼ë¡œ í”¼ë²—í•˜ê¸° (Pivoting â€œWideâ€ to â€œLongâ€ Format)
pivotê³¼ ë°˜ëŒ€ë˜ëŠ” ì—°ì‚°ì€ **pandasì˜ melt**ì´ë‹¤.
- ì—¬ëŸ¬ ì¹¼ëŸ¼ì„ í•˜ë‚˜ë¡œ ë³‘í•©í•˜ê³  DataFrameì„ ì…ë ¥ë³´ë‹¤ ê¸´ í˜•íƒœë¡œ ë§Œë“¤ì–´ë‚¸ë‹¤.

[ê³µì‹ë¬¸ì„œ) pandas.melt](https://pandas.pydata.org/docs/reference/api/pandas.melt.html)

In [ ]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

pandasì˜ meltë©”ì„œë“œë¥¼ ì‚¬ìš©í•  ë•ŒëŠ” ì–´ë–¤ ì»¬ëŸ¼ì„ ê·¸ë£¹ êµ¬ë¶„ìë¡œ ì‚¬ìš©í•  ê²ƒì¸ì§€ ì§€ì •í•  ìˆ˜ ìˆë‹¤.
- 'key'ë¥¼ ê·¸ë£¹ êµ¬ë¶„ìë¡œ ì§€ì •í•´ë³´ì.
- **ì˜ë¯¸) 'key'ë¥¼ ê¸°ì¤€ìœ¼ë¡œ A,B,Cë¥¼ í–‰ìœ¼ë¡œ ë…¹ì¸ë‹¤.(melt)**
- A,B,Cê°’ì„ ì¸ë±ìŠ¤ ë³„ë¡œ ì¶”ì¶œí•˜ê¸°ì— ìš©ì´í•´ì§„ë‹¤.

In [ ]:
melted = pd.melt(df, ['key'])     # ë°ì´í„°ê°€ ê¸¸ì–´ì§.
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

#### pivotì„ ì´ìš©í•´ì„œ ì›ë˜ëŒ€ë¡œ ë˜ëŒë¦´ ìˆ˜ ìˆë‹¤.

In [ ]:
reshaped = melted.pivot('key', 'variable', 'value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

pivotì˜ ê²°ê³¼ëŠ” ë¡œìš° ë¼ë²¨ë¡œ ì‚¬ìš©í•˜ë˜ ì¹¼ëŸ¼ì—ì„œ ì¸ë±ìŠ¤ë¥¼ ìƒì„±í•˜ë¯€ë¡œ reset_index()ë¥¼ ì‚¬ìš©í•´ì„œ ë°ì´í„°ë¥¼ ë‹¤ì‹œ ì¹¼ëŸ¼ìœ¼ë¡œ ëŒë ¤ë†“ëŠ”ë‹¤.

In [ ]:
reshaped.reset_index()

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

#### ë°ì´í„° ê°’ìœ¼ë¡œ ì‚¬ìš©í•  ì¹¼ëŸ¼ë“¤ì˜ ì§‘í•©ì„ ì§€ì •í•  ìˆ˜ë„ ìˆë‹¤.
- id_var, value_vars ë§¤ê°œë³€ìˆ˜ ì‚¬ìš©
- 'key'ë¥¼ ê¸°ì¤€ìœ¼ë¡œ 'A'ì™€ 'B'ì˜ ê°’ì„ í–‰ì— ë…¹ì¸ë‹¤.

In [ ]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

#### pandas.meltëŠ” ê·¸ë£¹ êµ¬ë¶„ì ì—†ì´ë„ ì‚¬ìš©í•  ìˆ˜ ìˆë‹¤.
A, B, Cì™€ ê°’ì´ í–‰ìœ¼ë¡œ ë“¤ì–´ê°„ë‹¤.

In [ ]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [ ]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6